# Напишите программу, которая принимает на вход
#  вещественное число и показывает сумму его цифр.
# Пример:
# 6782 -> 23
# 0,56 -> 11

# x = input('Введите вещественное число: ')
# def summa(x):                            #Функция нахождения суммы чисел в заданном числе
#     if float(x) < 0:                            #Проверка на знак перед числом
#         x = float(x) * (-1)
#     number = 0

#     for i in str(x):
#         if i != '.':
#             number += int(i)
#     return number
 
# print(f'Сумма чисел равна {summa(x)}')

x = list(map(int, input('Введите вещественное число: ').replace('.', '')))
sum_1=sum(x)
print (sum_1)

